/* Non-user-facing error text for a connection that has been closed due to a timeout. */
"GCDAsyncSocketClosedError" = "リモート ピアによってソケットを閉じました";

/* Non-user-facing error text for an attempted connection that has failed due to a timeout. */
"GCDAsyncSocketConnectTimeoutError" = "タイムアウトしたホストに接続しようとしました";

/* No comment provided by engineer. */
"GCDAsyncSocketOtherError" = "ソケット FD からのソケット作成に失敗しました。 getpeername() に失敗しました";

/* Non-user-facing error text for a read operation that has read the maximum amount of allowed data. */
"GCDAsyncSocketReadMaxedOutError" = "読み取り操作は最大長に設定しました";

/* Non-user-facing error text for a read operation that has failed due to a timeout. */
"GCDAsyncSocketReadTimeoutError" = "読み取り操作はタイムアウトしました";

/* Non-user-facing error text for a write operation that has failed due to a timeout. */
"GCDAsyncSocketWriteTimeoutError" = "書き込み操作はタイムアウトしました";

